Revit 2026 API

# RevisionRevisionDate Property

---

The date of this Revision.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RevisionDate { get; set; }
```
```vb
Public Property RevisionDate As String
	Get
	Set
```
```cpp
public:
property String^ RevisionDate {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member RevisionDate : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: This operation cannot be performed on Revisions that have already been issued. |

The Revision date is an arbitrary String and can be blank. Revit will not attempt to interpret it as an actual date.

#### Reference

Revision Class

Autodesk.Revit.DB Namespace